Revit 2027 API
FormattedText.GetBoldStatus Method
 Returns whether All, None or a Mixed of characters in the entire text are bold.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FormatStatus GetBoldStatus()
Public Function GetBoldStatus As FormatStatus
public:
FormatStatus GetBoldStatus()
member GetBoldStatus : unit -> FormatStatus
Return Value
FormatStatus
 The format status of bold on characters FormatStatus.
Remarks
 This function only returns All or None if the entire text contains one character.
See Also
Reference
FormattedText Class
GetBoldStatus Overload
Autodesk.Revit.DB Namespace